app/views/gossip/show_gossip.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    <br>
    <%= "Written by #{@gossip.user.first_name}"%>