app/views/gossip/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    <br>
    <span> Written by </span><a href="/author/<%= @gossip.user_id %>"><%= @gossip.user.first_name %></a>