app/controllers/cities_controller.rb

    def show
        @city = City.find(params[:id])
        @users = User.all
        @gossip = Gossip.all
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "gossips".* FROM "gossips"