app/controllers/gossip_controller.rb

INSERT INTO "cities" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Paris"], ["created_at", "2020-02-11 17:11:11.729965"], ["updated_at", "2020-02-11 17:11:11.729965"]]
INSERT INTO "users" ("first_name", "last_name", "email", "age", "city_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "titre 1"], ["content", "sqfqs"], ["user_id", 4], ["created_at", "2020-02-11 10:50:11.246069"], ["updated_at", "2020-02-11 10:50:11.246069"]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 27]]
DELETE FROM "cities" WHERE "cities"."id" = $1  [["id", 8]]
---
  def create
    @city = City.create(name: params[:city])
    @user = User.create(age: params[:age], first_name: params[:first_name], last_name: params[:last_name], email: params[:email], city_id: @city.id)
    @gossip = Gossip.new(user_id: @user.id, content: params[:content], title: params[:title]) # avec xxx qui sont les données obtenues à partir du formulaire
    if @gossip.save # essaie de sauvegarder en base @gossip
      @success = true
      render "gossip/new"
    else
      @city.destroy

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
def find_post
  @gossip = Gossip.find(params[:id])