app/controllers/home_controller.rb

    def index
        @gossips = Gossip.all.sort_by(&:id).reverse
---
SELECT "gossips".* FROM "gossips"