app/views/cities/show.html.erb

        <p>
          <% if User.find_by(city: @city.id).id == gossip.user.id then %>
---
SELECT  "users".* FROM "users" WHERE "users"."city_id" = $1 LIMIT $2  [["city_id", 3], ["LIMIT", 1]]