app/views/author/show.html.erb

SELECT "gossips".* FROM "gossips"
---

<% if @user.gossips.count > 0 %>